# Introdução a Pandas

## Importando bibliotecas

In [1]:
import pandas as pd
import numpy as np

## Criando dados de exemplo

In [2]:
data = {
    "Nome": ["Ana", "Pedro", "João", "Renato", "Alice"],
    "Idade": [22, 23, 20, 19, 22],
    "Cidade": ["Rio", "São Paulo", "BH", "Brasília", "Vitória"]
}

## Criando um dataframe a partir de um dicionário

Esse é um comentário em markdown.

In [3]:
# Esse é um comentário em python

df = pd.DataFrame(data)
df

     Nome  Idade     Cidade
0     Ana     22        Rio
1   Pedro     23  São Paulo
2    João     20         BH
3  Renato     19   Brasília
4   Alice     22    Vitória

Acessando uma coluna do dataframe:

In [4]:
# Pegando um "sub" dataframe a partir do original
df[["Nome", "Cidade"]]

     Nome     Cidade
0     Ana        Rio
1   Pedro  São Paulo
2    João         BH
3  Renato   Brasília
4   Alice    Vitória

In [5]:
row = df.loc[1]
row

Nome          Pedro
Idade            23
Cidade    São Paulo
Name: 1, dtype: object

In [6]:
# Pegando um array
df["Idade"]

0    22
1    23
2    20
3    19
4    22
Name: Idade, dtype: int64

Deletando uma coluna no dataframe:

In [7]:
del df["Nome"]
df

   Idade     Cidade
0     22        Rio
1     23  São Paulo
2     20         BH
3     19   Brasília
4     22    Vitória

Inserindo uma coluna no dataframe:

In [8]:
# Posicao, Nome_Coluna, Valor

df.insert(0, "Nome", ["Ana", "Pedro", "João", "Renato", "Alice"])
df

     Nome  Idade     Cidade
0     Ana     22        Rio
1   Pedro     23  São Paulo
2    João     20         BH
3  Renato     19   Brasília
4   Alice     22    Vitória

Montando um novo conjunto de dados, agora com entradas numéricas inválidas

In [9]:
data = {
    "Nome": ["Ana", np.nan],
    "Idade": [22, np.nan]
}

df = pd.DataFrame(data)
df

  Nome  Idade
0  Ana   22.0
1  NaN    NaN

In [10]:
df.isnull()

    Nome  Idade
0  False  False
1   True   True

In [11]:
df.fillna(0)

  Nome  Idade
0  Ana   22.0
1    0    0.0

In [14]:
df.dropna(inplace=True)
df

  Nome  Idade
0  Ana   22.0

In [15]:
data = {
    "NOMe": ["Ana", "Pedro"],
    "IDD": [22, 23]
}

df = pd.DataFrame(data)
df

    NOMe  IDD
0    Ana   22
1  Pedro   23

Renomeando colunas

In [16]:
df.columns = ["name", "age"]
df

    name  age
0    Ana   22
1  Pedro   23

In [17]:
newcols = {
    "name": "Nome",
    "age": "Idade"
}

df.rename(columns=newcols, inplace=True)
df

    Nome  Idade
0    Ana     22
1  Pedro     23